# Ejercicio de Pandas

Carga las 2 librerias que hemos visto a lo largo del curso junto con su "apodo"

numpy, y pandas

**Coloca tu nombre y matricula** 

Nombre:Cecilia Sarahí Gutiérrez Padilla

Matricula: 1953437

1. Carga las librerias básicas

In [40]:
##### carga las dos librerias usadas (numpy, pandas ) 
import numpy as np
import pandas as pd

El siguiente comando importa un data frame desde un archivo csv de internet

In [41]:
ventas = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/ventas2.csv')

In [42]:
ventas

      Año         Mes  Ventas  Gasto
0    2010       Enero    1056    533
1    2010     Febrero     910    496
2    2010       Marzo    1095    695
3    2010       Abril    1157    599
4    2010        Mayo     969    490
..    ...         ...     ...    ...
163  2023      Agosto    1759   1818
164  2023  Septiembre    2114   2142
165  2023     Octubre    2120   1767
166  2023   Noviembre    2102   1652
167  2023   Diciembre    2166   2192

[168 rows x 4 columns]

En caso de que una cantidad contenga decimales, debe estar redondeada a un decimal

2. Características del dataframe

In [43]:
#con código de python muestra cuantas filas y columnas tiene el dataframe y como se llaman las columnas
ventas.shape

(168, 4)

In [44]:
ventas.columns

Index(['Año', 'Mes', 'Ventas', 'Gasto'], dtype='object')

In [45]:
#muestra las primeras 5 filas del dataframe
ventas.head()

    Año      Mes  Ventas  Gasto
0  2010    Enero    1056    533
1  2010  Febrero     910    496
2  2010    Marzo    1095    695
3  2010    Abril    1157    599
4  2010     Mayo     969    490

*ventas es una base de datos que contiene las ventas mensuales de una tienda X para los años 2010-2023*

3. Crea una nueva columna que se llame **Ganancias** y que contenga la diferencia entre ventas-gastos

In [46]:
## escribe aqui el código
ventas['Ganancias']= ventas['Ventas']-ventas['Gasto']

In [47]:
ventas

      Año         Mes  Ventas  Gasto  Ganancias
0    2010       Enero    1056    533        523
1    2010     Febrero     910    496        414
2    2010       Marzo    1095    695        400
3    2010       Abril    1157    599        558
4    2010        Mayo     969    490        479
..    ...         ...     ...    ...        ...
163  2023      Agosto    1759   1818        -59
164  2023  Septiembre    2114   2142        -28
165  2023     Octubre    2120   1767        353
166  2023   Noviembre    2102   1652        450
167  2023   Diciembre    2166   2192        -26

[168 rows x 5 columns]

4. Encuentra el mes-año con las ganancias más altas

In [48]:
## escribe aqui el código
ventas.sort_values('Ganancias', ascending=False).head(1)

     Año     Mes  Ventas  Gasto  Ganancias
91  2017  Agosto    1680   1088        592

5. Calcula e imprime las ventas totales, gastos totales y ganancias totales de  todo el periodo\
Ejemplo de mensaje: **las ventas totales son: 5000**, etc

In [50]:
## escribe aqui el código
print('las ventas totales son: ', ventas['Ventas'].sum())
print('las gastos totales son: ', ventas['Gasto'].sum())
print('las ventas totales son: ', ventas['Ganancias'].sum())

las ventas totales son:  235731
las gastos totales son:  181123
las ventas totales son:  54608

6. Calcula y muestra las ventas, gastos y ganancias para cada año

In [53]:
## escribe aqui el código
ventas.groupby('Año')['Ventas'].sum()

Año
2010    12015
2011    12778
2012    12965
2013    14037
2014    14922
2015    14951
2016    15376
2017    17189
2018    18325
2019    18204
2020    18917
2021    21057
2022    21692
2023    23303
Name: Ventas, dtype: int64

In [54]:
ventas.groupby('Año')['Gasto'].sum()

Año
2010     6756
2011     7806
2012     8430
2013     8963
2014    10377
2015    10784
2016    11053
2017    12369
2018    14648
2019    14759
2020    16206
2021    17693
2022    18946
2023    22333
Name: Gasto, dtype: int64

In [55]:
ventas.groupby('Año')['Ganancias'].sum()

Año
2010    5259
2011    4972
2012    4535
2013    5074
2014    4545
2015    4167
2016    4323
2017    4820
2018    3677
2019    3445
2020    2711
2021    3364
2022    2746
2023     970
Name: Ganancias, dtype: int64

7. Calcula y muestra las ventas promedio mensuales del año 2015

In [67]:
## escribe aqui el código
##Pista: primero filtra para el año 2015, luego selecciona la columna ventas 
ventas2015= ventas[ventas['Año']==2015]

In [68]:
ventas2015

     Año         Mes  Ventas  Gasto  Ganancias
60  2015       Enero    1410   1004        406
61  2015     Febrero    1419   1006        413
62  2015       Marzo    1021    675        346
63  2015       Abril    1031    828        203
64  2015        Mayo    1470   1146        324
65  2015       Junio    1178    705        473
66  2015       Julio    1469   1186        283
67  2015      Agosto    1065    744        321
68  2015  Septiembre    1056    806        250
69  2015     Octubre    1412    869        543
70  2015   Noviembre    1264    902        362
71  2015   Diciembre    1156    913        243

In [69]:
ventas2015['Ventas'].mean().round(1)

1245.9

8. Calcula e imprime las ventas totales y ventas promedio para los eneros. Es decir, para enero de 2010, enero de 2011, enero 2012, etc

In [79]:
## escribe aqui el código ventas totales
##Pista: primero filtra los meses de enero, luego selecciona la columna ventas 
ventasEnero= ventas[ventas['Mes']=='Enero']
suma= ventasEnero['Ventas'].sum()
print ('Las ventas totales son de:', suma)

Las ventas totales son de: 20073

In [90]:
## escribe aqui el código ventas promedio
prom= ventasEnero['Ventas'].mean().round(1)
print('Las ventas promedio totales son de: ', prom)

Las ventas promedio totales son de:  1433.8

9. Calcula las ventas promedio por mes, y muestra los meses ordenados de menor a mayor según su promedio

In [89]:
## aqui va tu codigo
ventas.groupby('Mes')['Ventas'].mean().sort_values(ascending=True).round(1)

Mes
Junio         1325.7
Septiembre    1347.4
Julio         1363.6
Octubre       1388.3
Marzo         1394.4
Febrero       1406.4
Mayo          1409.7
Diciembre     1416.6
Enero         1433.8
Agosto        1437.9
Noviembre     1456.6
Abril         1457.5
Name: Ventas, dtype: float64